app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])
    @user = User.create( params[:user] )
    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 19 Sep 2013 10:01:17 UTC +00:00], ["name", "pen"], ["price", #<BigDecimal:7f3bd41a2a40,'0.45E2',9(18)>], ["updated_at", Thu, 19 Sep 2013 10:01:17 UTC +00:00]]

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      puts params
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "products" SET "attach_file_name" = '338851_303643403069171_428151341_o.jpg', "attach_content_type" = 'image/jpeg', "attach_file_size" = 107503, "attach_updated_at" = '2013-10-22 14:40:14.354602', "pic_file_name" = 'black-tiger-lg-gt950-arena-mobile-phone-wallpaper.jpg', "pic_content_type" = 'image/jpeg', "pic_file_size" = 110085, "pic_updated_at" = '2013-10-22 14:40:14.581254', "updated_at" = '2013-10-22 14:40:14.841762' WHERE "products"."id" = 8